app/Http/Controllers/Admin/CategoryController.php

    public function index()
    {
        $categories = Category::where('parent_id_1', 0)->where('parent_id_2', 0)->get();
---
select * from `categories` where `parent_id_1` = 0 and `parent_id_2` = 0

    public function show($id)
    {
        $category = Category::find($id);
        $category_mid = Category::where('parent_id_1', $id)->where('parent_id_2', 0)->get();
---
select * from `categories` where `parent_id_1` = '1' and `parent_id_2` = 0