app/Http/Controllers/Admin/ColorController.php

    public function index()
    {
        $colors = Color::all();
---
select * from `colors`