app/Http/Controllers/Admin/ProductController.php

    public function index()
    {
        $products = Product::all();
        foreach ($products as $index => $product) {
            $image_id = ProductImage::where('product_id', $product->id)->orderBy('created_at', 'desc')->first();
---
select * from `products`
select * from `product_image` where `product_id` = 1 order by `created_at` desc limit 1

    public function create()
    {
        $categories = Category::where('parent_id_1', 0)->where('parent_id_2', 0)->get();
---
select * from `categories` where `parent_id_1` = 0 and `parent_id_2` = 0

    public function edit($id)
    {
        $category_big = array();
        $category_mid = array();
        $category_small = array();
        $array_category_small = array();
        $array_category_mid = array();
        $product = Product::with('images')->find($id);
        $categories = Category::where('parent_id_1', 0)->where('parent_id_2', 0)->get();
        $list_category = json_decode($product->category_id);
        if (!empty($list_category)) {
            if (!empty($list_category[0])) {
                $category_big = Category::find($list_category[0]);
                $array_category_mid = Category::where('parent_id_1', $list_category[0])->where('parent_id_2', 0)->get();
            }

            if (!empty($list_category[1])) {
                $category_mid = Category::find($list_category[1]);
                $array_category_small = Category::where('parent_id_1', $list_category[0])->where('parent_id_2', $list_category[1])->get();
---
select * from `products` where `products`.`id` = '1' limit 1
select `images`.*, `product_image`.`product_id` as `pivot_product_id`, `product_image`.`image_id` as `pivot_image_id`, `product_image`.`created_at` as `pivot_created_at`, `product_image`.`updated_at` as `pivot_updated_at` from `images` inner join `product_image` on `images`.`id` = `product_image`.`image_id` where `product_image`.`product_id` in (1)
select * from `categories` where `parent_id_1` = 0 and `parent_id_2` = 0
select * from `categories` where `parent_id_1` = '1' and `parent_id_2` = 0
select * from `categories` where `parent_id_1` = '1' and `parent_id_2` = '2'

                    $images_id = Image::whereIn('id', $request->images)->pluck('id')->toArray();
                    $product->images()->sync($images_id);
                } else {
                    $img_diff = $product->images->pluck('id')->toArray();
                    $product->images()->detach();
---
select `images`.*, `product_image`.`product_id` as `pivot_product_id`, `product_image`.`image_id` as `pivot_image_id`, `product_image`.`created_at` as `pivot_created_at`, `product_image`.`updated_at` as `pivot_updated_at` from `images` inner join `product_image` on `images`.`id` = `product_image`.`image_id` where `product_image`.`product_id` = 1
delete from `product_image` where `product_image`.`product_id` = 1


                // delete image to storage
                if (!empty($img_diff)) {
                    $image_name = Image::whereIn('id', $img_diff)->get();
---
select * from `images` where `id` in (1)

                        \File::delete(public_path() . '/storage/product/' . $item->description);
                    }

                    Image::whereIn('id', $img_diff)->delete();
---
delete from `images` where `id` in (1)

                        $image = new Image();
                        $image['name'] = $item[1];
                        $image['description'] = $img;
                        $image->save();
---
insert into `images` (`name`, `description`, `updated_at`, `created_at`) values ('599564_02-min.jpg', 'img2021061903165019089400.jpeg', '2021-06-19 03:16:50', '2021-06-19 03:16:50')

                            $product_image = new ProductImage();
                            $product_image['product_id'] = $product->id;
                            $product_image['image_id'] = $image->id;
                            $product_image->save();
---
insert into `product_image` (`product_id`, `image_id`, `updated_at`, `created_at`) values (1, 2, '2021-06-19 03:16:50', '2021-06-19 03:16:50')