app/Http/Controllers/Admin/SizeController.php

select * from `sizes`
---
    public function index()
    {
        $sizes = Size::all();